import "./box.css";
import MainTitle from "../mainTitle/MainTitle";
import Image from "next/image";
import img from "../../imgs/engineer.png";
function Box() {
  const data = [
    {
      id: 1,
      head: "  مقاولات وتشطيبات بالكويت",
      cont: " نوفر خدمات التشطيبات على اعلى مستوى مفهومنا للبناء يرتكز على تصميم منازل تراعي جودة الحياة للفرد ، ان مفهومنا للبناء و الديكور نابع من كوننا نعشق الجمال و تمكين الاشخاص من الحصول على منزل احلامهم ، لدينا افضل التصميمات العالمية و تناسب جميع الاذواق لذا تحرص شركتنا شركة مقاولات وترميمات عامة بالكويت دائما علي تقديم افضل الخدمات باقل الاسعار التي تناسب جميع عملائنا.",
    },

    {
      id: 2,
      head: "مقاولات عامة وترميمات بالكويت",
      cont: "تعمل    مقاولات عامة وترميمات بالكويت في التصميمات الداخلية و التصميمات الخارجية منذ سنوات عديدة. وهو ما يجعلها شركة لديها الخبرة الكافية وسمعة طيبة في التصميم لتقوم بتصميم المكان الخاص بك على أعلى مستوى من الاحترافية العالية.  تساعدك شركة مقاولات وترميمات عامة بالكويت ان تقوم بعمليه الاشراف علي العاملين اثناء العمل ومن الخطأ ان تترك العامل يعمل بنفسه، لابد من الاشراف و وضع المعايير و متابعه كافه العمل لضمان الوصول الي التصميم الذي تريده ، من الافضل دائما الاتفاق مع العاملين علي التكلفه وذلك ضمانا لسير العمل و يضمن لكل من الطرفين حقوقهم منعا من الخلاف اثناء العمل مما يؤدي الي تعطيل العمل واذا رفض العامل الاتفاق علي التكلفه فيجب ان تتعامل مع فريق اخر من العمال ،يجب عليك قبل بدايه اعمال التشطيب في السقف و الحوائط و القواطع الجبسيه ان تتاكد من سلامه ارضيه الطابق الذي يعلوك وذلك للحرص والتاكد من عدم وجود تسريبات مياه حتي لا تفسد لك العمل ،لابد من اختيار عامليين ذو خبره في عمل الارضيات و السيراميك ومراعاه ان يستخدم ميزان الماء وان يكون هناك ميل في اتجاه الحمام وذلك يفيدك في عمليه النظافه في المستقبل. يجب عليك اختيار افضل انواع السيراميك ومن المفضل اختيار التصميمات اللامعه في انواع السيراميك تعطي مظهرا اجمل ، هناك فكره شائعه وهي ان تتضم البلكونه الي مساحه الشقه وذلك من باب توسيع المساحه في الشقه ولكن يجب عليك الاهتمام بوضع البلكونه فتعطي للشقه هوائا جميلا ورضبا ولها استخدامات رائعه.لذا إذا كنت تبحث عن شركة مقاولات عامة وترميمات بالكويت قم بالاتصال بنا للرد على استفساراتك.",
    },
    {
      id: 3,
      head: "مقاول ترميمات عامة بالكويت",
      cont: "مقاول ترميمات عامة بالكويت نحاول جميعنا ان نجعل من منازلنا مثال للذوق الرفيع والاناقة والتميز ونقوم بعمل ذلك من خلال الاهتمام الشديد باختيار قطع الاثاث وباختيار الالوان والتحف وايضا الديكورات حيث نسعى الى ان يكون منزلنا من افضل المنازل واكثرها ذوق وجمال ونسعى الى تحقيق ذلك من خلال الاختيار المناسب لكى شىء فى المنزل والدقة والذوق الرفيع اثناء هذا الاختيار ويمكننا فى بعض الاحيان الاستعانة بالمتخصصين فى هذا المجال ما يمتلكون من مهارات فى كيفية وضع افضل التصميمات للمنزل وما يتناسب مع كل منزل عن غيره وافضل الالوان والطرق التى يوضع بها قطع الاثاث وغيره من التحف وما يمكن تنسيقه للخروج بأبهى صورة ويعتبر مقاول ترميمات عامة بالكويت وصبغ منازل وفلل وجميع الديكورات بالكويت افضل المتخصصين فى هذا المجال .",
    },
    {
      id: 4,
      head: "مقاول دهان وصباغة بالكويت",
      cont: "نمتلك    احدث الادوات  ونستخدمها في تنفيذ اعمالنا المميزة افضل واجود انواع الدهانات المشهورة والمعروفه ومنها دهانات جوتن والجزيرة حيث ان دهانات جوتن ودهانات الجزيرة من افضل انواع الدهانات التي تستخدم في الدهانات والأصباغ سواء دهانات داخلية او خارجية وتعرف هذه الأنواع بعمرها الافتراضي الطويل كما أنها لا تغير الوانها مع العوامل الجويه المختلفه او مع الغسيل كما أنها مقاومة للرطوبة.  لذا يحرص صباغ الكويت على استخدام دهانات جوتن والجزيرة لتوفير أفضل خدمة اصباغ ودهانات لعملائه، كما تتميز دهانات جوتن والجزيرة بتوفر الوان عديدة منها وجميع الدرجات تتوفر لذا يمكن الحصول على اللون والدرجة المطلوبة دون عناء، ويحرص صباغ بويات بالكويت على توفير نفس درجة اللون المطلوبة باستخدام الوان الكمبيوتر التي تعطي نفس درجة اللون المطلوبة.",
    },
    {
      id: 5,
      head: "معلم صباغ بالكويت",
      cont: "إذا كنت ترغب في تجديد منزلك بالكامل وترغب في التخلص من المظهر التقليدي القديم للدهانات وترغب في الحصول على مظهر دهانات ديكوري حديث والوان جديدة مميزة تتوافق مع العام الجديد وتضفي لمسة من الجمال والاناقه والذوق الرفيع المميز على المكان فلا داعي للبحث طويلاً والحيرة ما بين شركات الدهانات والديكورات فلدي شركتنا معلم صباغ بالكويت ممتاز.",
    },

    {
      id: 6,
      head: "مقاول تركيب سيراميك بالكويت",
      cont: "مقاول تركيب سيراميك بالكويت وتشكيل ديكور الأرضيات من أبرز الخدمات التي يجب أن نهتم بها لكونها تعبر عن الشكل العام للمنزل ومستوى الأفراد، ولا يتمكن أي شخص من القيام بتشكيل بلاط الأرضيات لابد من وجود حرفى متخصص .    لنا بائع كبير في مجال التشطيبات نقدم لكم افضل معلم بلاط بالكويت يمتلك خبرة كافية للقيام بتشكيل جميع أنواع الأرضيات،وتركيب البلاط وكافة الأنواع الأخرى من البورسلان،السيراميك،الرخام،كما يمتع بحس الفن الإبداعى في تنسيق الديكور.  ومن الهام بالذكر أن أسعار خدمات تركيب البلاط المقدم   مع جميع العملاء،مع وجود مجموعة من العروض المتنوعة على جميع الخدمات اتصل بنا للحصول على أفضل خدمات بأحسن الأسعار.",
    },
    {
      id: 7,
      head: "معلم تركيب رخام بالكويت",
      cont: "وجود معلم البلاط بأي شركة يتسبب في ارتفاع نسبة تعاقدها مع العملاء من كافة الدول العربية وهذا لما يقدمه المعلم من عمل احترافي مميز يجعل أعمال الشركة تتميز بكفاءة عالية، بالإضافة إلى أن معلم البلاط يقوم بتدريب العاملين الجدد بالشركة على مستوى عالي لما يمتلك من خبرة مهنية طويلة بهذا المجال.  كما تتمثل أهمية معلم بلاط بالكويت في كونه يمتلك الخبرة في تركيب جميع أنواع البلاط لمختلف البنايات من شقق وفنادق وفلل وحمامات سباحة وغيرها لهذا يعد وجوده بأي شركة مكسب كبير لها.",
    },
    {
      id: 8,
      head: "مقاول عام بالكويت",
      cont: "نقوم ببناء العمائر والفلل والهناجر والملاحق والاستراحات تشطيب تسليم مفتاح عظم مع المواد عظم وكافة الخدمات للمقاولات في الكويت مقاول ملاحق مقاول عظم الكويت أفضل مقاول بناء فلل عظم في الكويت مقاول تشطيب مقاول بناء عام فلل عمائر مساجد مستودعات تنفيذ مشاريع انشاء ملاحق علويه وارضيه بدرومات خزانات",
    },
    {
      id: 9,
      head: "مقاول بناء ملاحق بالكويت",
      cont: "نتخصص في كافة اعمال بناء مجالس خارجية بالكويت ، بناء ملاحق الكويت ، حيث نوفر افضل كادر عمل مكون من معلم بناء ملاحق الكويت ، مقاول مباني وملاحق ومجالس بأفضل الأسعار ، مقاول بناء مجالس واستراحات ، معلم بناء غرف والعديد من أمهر مقاولين ومعلمين بناء غرف وملحقات خارجية بالكويت ، مقاول بناء الكويت هو الأفضل والأنسب لك من ناحية جودة العمل كذلك السعر المناسب.",
    },
    {
      id: 11,
      head: "مقاول بناء فلل بالكويت",
      cont: "مقاول بناء و تشطيب و ترميم مقاولات عامة في الكويت عمال بناء تشطيب كامل مقاول عام لتنفيذ جميع أعمال التشطيبات والترميمات . افضل مقاول فلل والقصور ترميم وتشطيب ملاحق استراحات مقاول ترميم في الكويت , مقاول تشطيب في الكويت , مقاول عام في الكويت , ارخص مقاول في الكويت , افضل مقاول بناء الكويت , مطلوب مقاول الكويت , مقاول عظم الكويت , مقاول بناء الكويت , مقاول بناء فلل ملاحق استراحات مسابح ترميم تشطيب مقاول عام , مقاول بناء عام , نجار مباني الكويت , نجار فلل , نجار تسليح بناء",
    },
    {
      id: 12,
      head: "بناء فلل تسليم مفتاح بالكويت",
      cont: "عزيزي العميل إن كنت تبحث عن أفضل شركة تقوم ببناء الفلل فلن تجد أفضل من شركتنا، حيث أنها تقوم ببناء الفلة وتقوم بتسليم المفتاح للعميل، فهي من الشركات المتخصصة في بناء الفلل، فيبدأ فريق العمل بالحفر والردم، ومن ثم يقوم بعمل قواعد وأعمدة وأسقف، ويقوم بجميع أعمال الخرسانة، ومن ثم يقوم بالتشطيب الداخلي والخارجي.",
    },
    {
      id: 13,
      head: "مقاول ترميم مباني بالكويت",
      cont: "الترميم هو عملية صيانة للمبنى من خلال إعادة تصليح كل ما حدث له من تلف وتآكل وشقوق، بسبب عوامل الطبيعة المختلفة، فتعتبر عملية الترميم حماية كاملة للمبنى والحفاظ عليه من السقوط أو الانهيار، وعندما يحدث ترميم للمبنى يصبح أكثر قوة ومتانة، ويكون آمن وصالح للسكن فيه بعد ترميمه بشكل جيد.",
    },
    {
      id:14,
      head:"مقاول تكسير مباني بالكويت",
      cont:"هناك العديد من طرق التكسير التى تحتاج إليها فى المبانى والتى تساعد فى توفير الهدم والكسر سواء كان الكسر جزئي أو الكسر الكلي من أهم ما يتم القيام بها ما يلي:  العمل على توفير الهدم الجزئي من خلال القيام بتوفير خدمات المقاولات والعمل على توفير جزء معين من المبنى  وذلك من أجل إجراء الفحوصات الطبية والكشف عليها والقيام بتوضيح سبب الهدم واء كان بسبب الحريق والتلف  أو التعرض لترميمات التى يحتاج إليها المبانى والتخلص من الجزء المصاب  مع الحفاظ على المبنى بشكل عام من المتغيرات التى تتعرض لها.  الهدم الكلي:- يعد هذا النوع من الهدم من أفضل أنواع الهدم بكل أركانة وأنواعه وجوانبه وقد يكون الغرض من الهدم هو بناء مبنى جديد أو بغرض  إنتهاء العمر الافتراضي للمبنى ويحتاج لعملية الترميم والإصلاح من جديد.  تعتبر شركتنا من أفضل الشركات التى تعمل فى مجال الهدم والتى تساهم بشكل كبير فى التخلص من أساليب الهدم التقليدية وطرق الهدم التى تسبب العديد من المخاطر فمن أجل الوصول للكفاءة والخبرة اللازمة فى الهدم ،فنحن نمتلك خبرة أكثر من عشر سنوات ومازالت فى البحث عن كل ما هو جديد فى مجال الهدم ومازالت تقوم بتوفير كافة الأجهزة والالات التى تساعد على الهدم الصحيح والسريع."
    },
    {
      id:15,
      head:"مقاول عزل اسطح جيتاروف بالكويت",
      cont:"تعتبر شركتنا واحدة من أفضل شركات عزل الاسطح بالكويت حيث تقدم الشركة جميع خدمات العزل المائى والحرارى والفوم وذلك من خلال مواد تستوردها الشركة من الخارج لحماية الأسطح من التغييرات الجوية وأشعة الشمس.  تضمن لك الشركة حماية سطح منزلك من الرطوبة والحرارة الشديدة فهدف الشركة فى المقام الأول هو راحة العميل وكل هذا بأسعار غير قابلة للمنافسة.  تقدم الشركة أيضاً خدمات عزل المطابخ والأسقف والأرضيات والحمامات وذلك لحمايتها من التسرب والرطوبة فالأمر لا يقتصر على عزل الاسطح فقط."
    },
    {
      id:16,
      head:"مقاول مساح وسيجما الكويت",
      cont:"مقاول مساح وسيجما الكويت من أفضل الشركات بالكويت في مجال المقاولات العامة  معلم مساح وسيجما يمكنك أن تتعاقد معه، حتى يقدم لك الأعمال الخاصة بالتشطيبات الخارجية والداخلية،  وهو إلى جانب ذلك يصمم الواجهات بكل اتقان وإحتراف،  لذلك هو المساح الأفضل في ذلك المكان، بالإضافة إلى أن أسعاره لا مثيل لها، فهو أرخص مساح وسيجما في المنطقة"
    }

  ];
  const siramik = [
    {
      id: 1,
      head: "السيراميك",
      cont: "من الأنواع الشائعة توجد بكثرة في المنازل، والشقق، يتأثر بسهولة بعوامل المناخ يتعرض للرطوبة وتعتبر الرطوبة من العوامل الخطيرة التي تؤثر على شكل ورونق السيراميك وتفسد مظهره،وتستعين شركة تركيب السيراميك بالكويت بأحسن معلمين بلاط بالكويت لمعالجة السيراميك حيث يقومون بالتخلص من البقع، وعلاج الخدوش، بالإضافة إلى إعادة الألوان الثابتة باستخدام ماكينات متطورة.",
    },
    {
      id: 2,
      head: "البورسلين",
      cont: "من الأنواع الجيدة يتميز بخصائص مقاومة للحرارة، والبرودة، يتمتع بمميزات عديدة منها عدم التعرض للخدوش،كذلك لا تنطفىء لمعته، وتمتلك افضل شركة تركيب سيراميك في الكويت أجهزة ومعدات تقنية لتنظيف البورسلين والحفاظ على بريقه، ومن الهام بالذكر أن فريق العمل لدى شركة تركيب بورسلين بالكويت مدرب على استخدام الأجهزة الحديثة في علاج مشاكل البورسلين.",
    },
    {
      id: 3,
      head: "الجرانيت",
      cont: "من الأنواع التي تهتم شركة تركيب السيراميك بالكويت بتركيبه، ويوجد عادة في القصور، والفلل، والشركات، ويعد الجرانيت من أقوى الأنواع صلابة وقوة يمكنه تحمل العوامل المختلفة، كذلك يحتوي على سطح ناعم مميز بخطف الأنظار ببريقه، وتستعين شركتنا بمعلمين بلاط بالكويت لتركيب الجرانيت.",
    },
    {
      id: 4,
      head: "الباركيه",
      cont: "من أبرز الأنواع سهل في تركيبه مصنوع من الخشب تحديداً خشب السندباد، وخشب الزان، ويوحى هذا النوع من الأرضيات بالرقى والفخامة؛ حيث يضفى رونق مميز في المكان يجذب الأنظار، لا يتعرض للكسرأو الخدوش، ويستطيع معلم بلاط بالكويت تركيب الباركيه بسهولة.",
    },
    {
      id: 5,
      head: "الفينيل",
      cont: "من الأنواع المميزة للغاية،متعدد الأشكال، كذلك يوجد منه أنواع مختلفة، وأحجام متنوعة حاز على شهرة واسعة في الآونة الأخيرة وأصبح الكثير يعتمد عليه في تشكيل ديكور المنزل.  من جانب أخر يتميز الفينيل بقدرته الفائقة على مقاومة عوامل تسربات المياه، مع الإحتفاظ بشكله المبهر لفترة طويلة، فضلاً عن سهولة تركيبه وتنظيفه من قبل شركة تركيب البلاط في الكويت مع نخبة من امهر العمالة المتخصصة.",
    },
    {
      id: 6,
      head: "الرخام",
      cont: "الأرضيات من النوع الرخام من الأنواع الفريدة من نوعها، تستخدم في تشكيل أرضيات الفنادق، والفلل، والشركات، بالإضافة إلى المولات التجارية الفخمة.  يتميز بوجود ألوان متنوعة تثير الدهشة منها الأبيض، واللاتيه، والبيج، كما أنه يتكون من تصميمات عديدة مناسبة للمبني، يمكن للعميل اختيار التصميم المناسب مع تقديم المقترحات البديلة من قبل الشركة. تعتمد أفضل شركة تركيب رخام في الكويت على فريق عمالة متميز يمكنه التعامل مع الرخام، والقدرة على تشكيل التصميمات، ونقش الرسومات بسهولة",
    },
  ];
  const aazl = [
    {
      id:1,
      head:"عزل مائي",
      cont:"مع حلول فصل الشتاء تسقط الأمطار على الأسطح وتتجمع المياه مما قد يؤدى إلى تلف الديكورات والدهانات كما يمكن أن تحدث تشققات بالحائط والجدران.  تخلص الشركة من جميع هذه المشاكل كما تضمن لك حماية المبنى وذلك بإستخدام أقوى مواد العزل المائى.",

    },
    {
      id:2,
      head:"عزل حراري",
      cont:"إرتفاع درجة الحرارة يؤثر على الأسطح وعلى بنية المنزل من الداخل لذلك يعتبر العزل الحرارى هام جداً.  تساعدك شركة عزل اسطح بالكويت على التخلص من درجات الحرارة المرتفعة وذلك من خلال إستخدام مواد تمنع تسرب الحرارة.",

    },
    {
      id:3,
      head:"عزل فوم",
      cont:"يعانى أهل الكويت من إرتفاع درجة الحرارة والتسربات المائية لذلك يلجأ المعظم للبحث عن شركة عزل اسطح بالكويت لذلك تقدم الشركة خدمة عزل الفوم للتخلص من التسربات المائية ودرجات الحرارة المرتفعة لحماية الأسطح كما تقدم الشركة خدمات معالجة الحوائط والجدران من التشققات.",

    },
    {
      id:4,
      head:"عزل صوتي",
      cont:"تقدم الشركة خدمات العزل الصوتى وذلك لأننا نهتم فى المقام الأول براحتكم لذلك تساعدكم الشركة فى التخلص من الأصوات العالية والمرتفعة وذلك بإستخدام أفضل مواد العزل الصوتى.",
    }
  ]
  return (
    <section className="content">
      <MainTitle title="اعمالنا" />
      <section className="boxes">
        {data.map((box) => (
          <article className="box" key={box.id}>
            <div className="layer"></div>

            <h3>{box.head}</h3>
            <article className="info flex-center">
              <p>{box.cont}</p>
              <Image src={img} alt="تركيب بلاط مساح سيجما كربستون مقاولات عامة في الكويت ترميمات عامة في الكويت كربستون بناء هدم تشطيب " className="img" />
            </article>
          </article>
        ))}
        <MainTitle title="خدماتنا في تركيب البلاط" />
        {siramik.map((box) => (
          <article className="box-t" key={box.id}>
            <h3>{box.head}</h3>
            <article className="info flex-center">
              <p>{box.cont}</p>
            </article>
          </article>
        ))}
        <MainTitle title="خدماتنا في عزل الاسطح" />
        {aazl.map((box) => (
          <article className="box-t" key={box.id}>
            <h3>{box.head}</h3>
            <article className="info flex-center">
              <p>{box.cont}</p>
            </article>
          </article>
        ))}
      </section>
    </section>
  );
}

export default Box;
